Repository: mozilla-l10n/mt-training-data
Catalog: yua/yua_pontoon.tmx
Source language: en_us
Languages: yua

source: Blocked by Android
yua: Bloqueado tumen Android

source: Block JavaScript
yua: Ma’ meyajta’ak JavaScript

source: Block other content trackers
yua: Ma’ meyajta’ab le kaxan ba’al uti’al jejelas ba’ilob

source: Block potentially dangerous and deceptive sites
yua: Ma' meyajta'al kúuchilo'ob tsaay u loobintik meyajilo'ob wa ku tuusilo'ob

source: Block reported deceptive and attack sites, malware sites, and unwanted software sites.
yua: Ma' meyajtik le k'as loobintik kúuchilo'ob mix le ku tuusilo'ob, mix kúuchil ti' malware wa kúuchilo'ob ku meyaj ba'al ma' a k'áato'.

source: Block social trackers
yua: Ma’ meyajta’al le kaxan ba’al uti’al tsikbal máak

source: Block trackers
yua: Ma’ meyajta’al le kaxan ba’alo’

source: Block Web fonts
yua: Ma’ meyajta’al u sayab web

source: Browsing history cleared
yua: Ts'o'ok u tselik u k'ajláayil navegación

source: Browsing history cleared! 🎉
yua: U k'ajláayil navegación ts'o'ok u tselik! 🎉

source: Camera
yua: Cámara

source: Check that search string matches Example format
yua: Ila’al wa le nuupul ti’ u kaxbil ba’ale’ uts ti’ le paatul yáax e’esajilo’

source: Choose search engine
yua: Yéey motor xookilo'

source: Clear input
yua: Púustak le tsool ts’íibilo’

source: Close other tabs
yua: Muts'ik uláak' fichas

source: Close popup
yua: Muts'ik le popup

source: Close tab
yua: Muts'ik u ju'unil

source: Close Tab
yua: Muts'ik u ju'unil

source: Completed
yua: Ts'o'ok

source: Confirm Using Your Fingerprint
yua: Confirme u búukinta'al u huella dactilar

source: Connection is not secure
yua: Le conexión ma' táan segura

source: Connection is secure
yua: Le conexión jach segura

source: Connection not secure
yua: Conexión ma' segura

source: Content
yua: Ts'íibil

source: Content Blocking
yua: Bloqueo ti' le contenido

source: Cookie Banner Reduction
yua: Reducción ti' le banner ti' le cookies

source: Cookies and Site Data
yua: Cookies yéetel u péeksilil le tu’uxilo’

source: Daily usage ping
yua: Ping u búukinta'al sáansamal

source: Data Choices
yua: Jela’anil péeksilo’ob

source: Data Collection & Use
yua: Much’lantik péeksililo’ob yéetel bix beelankil

source: Default
yua: Le ta yáax ts’íibo’

source: Default browser, language
yua: Navegador tumen defecto, t'aan

source: Desktop site
yua: Ts'ono'oto' u escritorio

source: Developer tools
yua: Núukulilo'ob uti'al meyajil

source: Double-check the URL you entered.
yua: Ka’a ilej le URL ta ts’íibtaj.

source: Download Firefox
yua: Éemsa’ak Firefox

source: Drag from top & press back to exit
yua: Jíilankilo'ob tak ka'anal yéetel pulse paachil uti'al jóok'ol

source: Drag from top & use back gesture to exit
yua: Jíilankilo'ob tak ka'anal yéetel meyaj paachil uti'al jóok'ol

source: DRM-controlled content
yua: Contenido controlado tumen DRM

source: Embedded on sites to track your visits and to display functionality like share buttons
yua: Jupa’an ich je’e tu’uxake’ uti’al u kaxantik tu’ux ka maan ich web, bey xan uti’al u ye’esiktech bixilo’ob je’e bey le ka ts’áank’abtik uti’al a túuxtik ba’alob

source: Enable to have %s autocomplete over 450 popular URLs in the address bar.
yua: Habilitar u yaantal %s autocompleto yóok'ol 450 URLs populares ti' le barra direcciones.

source: Enable to have %s autocomplete your favorite URLs.
yua: Habilitar utia'al u yantal %s autocompletar u URLs favoritas.

source: Enabling may cause some pages to behave unexpectedly
yua: Wa ka meyajtike’ ju beytal u k’as jela’antik u meyaj jejelas tseel ju’unilob

source: Enhanced Tracking Protection
yua: Mejorada ti' protección ti' le seguimiento

source: Entering full screen mode
yua: Táan u yokol ti' modo pantalla completa

source: Enter search engine name
yua: Oksa’ak u k’áaba’ ti’ le u múuk’il ti’ u maan máak ich web

source: Enter search string
yua: Oksa’ak le nuupul ti’ u kaxbil ba’al

source: Erase
yua: Tuupuk

source: Erase and Open
yua: Tuupuk ts'óokole' ka je'ebek

source: Erase and open %1$s
yua: Tuupuk ts'óokole' ka je'ebek %1$s

source: Erase browsing history
yua: Lúubsal tuláakal tu'ux maanech

source: Erase browsing history?
yua: ¿Borrar le k'ajláayo' navegación?

source: Erase & open
yua: Tuupuk ts'óokole' ka je'ebek

source: Example: example.com
yua: E’esajil: example.com

source: Example: example.com/search/?q=%s
yua: E’esajil: example.com/search/?q=%s

source: Example: mozilla.org
yua: E’esajil: mozilla.org

source: Exceptions
yua: U jela'anil

source: Exit Private Browsing?
yua: ¿A k’áat a jóok’oj ti’ le maan ich web chen a wóok’sal wa’a?

source: Fast. Private. No distractions.
yua: Séeba'an. Pribaado. Mina'an distracción.

source: Find an app that can open link
yua: Kaxanta’ak junp’éel ba’il tu’ux ka pàajchajak u je’ik le nuupankila’

source: Find in Page
yua: Kaxtik te' linki abas kaambal

source: Finger moved too fast. Try again.
yua: Ta séeb péeksaj u yaal a k'ab. Béet tu ka'aten.

source: Fingerprint icon
yua: Wooj ti' ts'áalk'ab

source: Fingerprint not recognized. Try again.
yua: Ma' k'ajota'al a ts'áalk'ab. Béet tu ka'aten.

source: Firefox may install and run studies from time to time.
yua: Firefox je'el u páajtal u instalar yéetel ejecutar xook de vez en cuando.

source: Follow device theme
yua: Bin u yiit le dispositivo

source: For sites you add
yua: Utia'al u ts'ono'oto'ob ku ts'áabal

source: For top sites
yua: Utia'al u yáax kúuchilo'ob

source: General
yua: Tuláakalil

source: Get one-tap access to sites you use most%1$s Menu > Add to Home screen
yua: K'amik muuk' yéetel jump'éel toque ti' le lu'umo'ob ku meyajtiko'ob asab%1$s Menú > Ts'áabak ti' u yáax cha'anil tu'ux u chúunul meyaj

source: Get search suggestions
yua: K'amik sugerencias xookilo'

source: Get started
yua: Káajsik

source: Go back
yua: Suut

source: Got ‘em! We stopped this site from spying on you. Tap the shield any time to see what we’re blocking.
yua: Yaan teen! k je'elel le ts'ono'oto' u espiar ti' teech. Pulse ti' le escudo je'el ba'ax súutuko' utia'al u yil ba'ax k bloqueando.

source: Go to Settings
yua: Xeen ti' configuración

source: Help
yua: Áantaj

source: Hide webpages when switching apps and block taking screenshots.
yua: Ta’akbesa’al le tseel ju’unob web ken u káajal u k’exel biilalilo’ob.

source: HTTPS-Only Mode
yua: Modo chéen HTTPS

source: Insecure Connection
yua: K’as nuupankil

source: Installed search engines
yua: U múuk’il ti’ u maan máak ich web ts’oka’anilob

source: <label>Someone could be trying to impersonate the site and continuing could be risky.</label> <br><br> <label>%1$s does not trust <b>%2$s</b> because its certificate issuer is unknown, the certificate is self-signed, or the server is not sending the correct intermediate certificates.</label>
yua: <label>Yaan máax je'el u páajtal u yilik u beetik bey le ts'ono'oto' yéetel u seguer u beetik je'el u yantal riesgo.</label> <br><br> <label>%1$s ma' u k'ubik u yóol ti' <b>%2$s</b> tumen ma' k'ajóolta'an máax ts'áaik u certificado, le certificado ku firmarta'al tu juunal, wa le servidor ma' táan u túuxtik le certificados intermedios correctos.</label>

source: Language
yua: T’aanil

source: Libraries that we use
yua: Bibliotecas k meyajtiko'ob

source: Licensing information
yua: A'almaj t'aan ti' licencia

source: Location
yua: Úubikasion

source: Make %1$s default browser
yua: Yéeytej %1$s ka p’àatak bey a suuk a maan ich web yéeteli’

source: Make %1$s your default to protect your data with every link you open.
yua: Beet %1$s bey a defecto uti'al a kanáantik a datos yéetel tuláakal le enlace ku je'ek'abtik.

source: Make privacy a habit
yua: Suuktatech u kanáantal le a wóok’salo’

source: Manage sites
yua: Gestionar le lu'umo'

source: May result in missing icons or images
yua: Je’el u beytal u sa’atal le woojilo’ob wa le oochelo’ob

source: Microphone
yua: Micrófono

source: More options button
yua: Botón asab opciones

source: Mozilla strives to collect only what we need to provide and improve %1$s for everyone.
yua: Mozilla ku kaxantik u molik chen le jach k’áabetaj uti’al u ts’a’ik yéetel u ma’alobtal %1$s ti’ tuláakalilo’ob.

source: Navigate back
yua: Suutnen ti’ a maan ich web

source: Navigate forward
yua: Xeen toj táanil

source: New custom URL added.
yua: Túumben URL tsikbe’eltan ts’óok u ts’áabak.

source: New search engine added.
yua: Ts’óok u tsàabal túumben u múuk’il ti’ u kaxan ba’al máak ich web.

source: Next
yua: U láak’o’

source: NO
yua: MA’

source: None of the apps on your device are able to open this link. You can leave %1$s to search %2$s for an app that can.
yua: Mixjunp’éel le ba’il ich a núukulila’ u je’ik le nuupankila’. Je’el u beytal a jóok’oj ti’ %1$s uti’al a kaxtik junp’éel bail tu’ux u jèebej ich %2$s.

source: No thanks
yua: Ma', Nib óolal

source: Notification
yua: Notificación

source: Notifications let you erase your %1$s session with a tap. You don’t need to open the app or see what’s running in your browser.
yua: Le ku ts’a’ik ojelbil ba’ax ku yúuchule’ ku cha’ik u túupul le meyajil %1$s chen yéetel jun péets’ak. Mix k’áabet a je’ik u ba’il wa mix k’áabet a wilik ba’ax ku meyaj ich tu’ux a maano’.

source: Off
yua: Ma’ tu meyajta’al

source: OFF for this site
yua: OFF uti'al le ts'ono'oto'

source: OK, got it!
yua: ¡Na’atbij!

source: ON for this site
yua: ON uti'al le ts'ono'oto'

source: Open a link in a new tab Long-press any link on a page
yua: Je'e jump'éel enlace ti' jump'éel túumben tab Pulsa chowak je'el ba'ax enlace ti' jump'éel linki abas kaambal

source: Open every link in %1$s Set %1$s as default browser
yua: Je'e tuláakal le enlace ti' %1$s Ts'áa %1$s bey navegador tumen defecto

source: Open in %1$s
yua: Je'eb ich %1$s

source: Open link in another app
yua: Je’ebak le nuupankil ich yaanal ba’ilo’

source: Open Link in New Session
yua: Je’ebak nuupankil ich a túumben meyajil

source: Open links in apps
yua: Je'e enlaces ti' aplicaciones

source: <p>%1$s puts you in control.</p> <p>Use it as a private browser: <ul> <li>Search and browse right in the app</li> <li>Block trackers (or update settings to allow trackers)</li> <li>Erase to delete cookies as well as search and browsing history</li> </ul> </p> <p>%1$s is produced by Mozilla. Our mission is to foster a healthy, open Internet.<br/> <a href="%2$s">Learn more</a></p>
yua: <p>%1$s ku ts'áaik ti' kaambalil.</p> <p>Meyajt bey jump'éel navegador privado: <ul> <li>Kaxant yéetel navegar tu tojile' ti' le ka'anatako'ob</li> <li>Bloquear le rastreadores (wa actualizar configuración utia'al u permitir le rastreadores)</li> <li>Borrar utia'al u tselik le cookies bey xan le historial xookilo' yéetel navegación</li> </ul> </p> <p>%1$s ku beeta'al tumen Mozilla. K meyaje' leti' u yantal jump'éel Internet toj yéetel je'ek'ab.<br/> <a href="%2$s">Kaanbal asab</a></p>

source: Pages may load faster, but may also behave unexpectedly
yua: Le tseel ju’unob web je’el u beytal u meyaj séebanil chen ba’ale’ je’el u beytal u k’as k’exik u meyaj xan

source: Paste or enter URL
yua: Tak’bil wa oksa’ak u ts’íibtal URL

source: Performance
yua: Buka’ajil

source: Powered by %1$s
yua: Léench’inta’ab yéetel %1$s

source: Power up your privacy
yua: Nojochkúuns a ba’il ta wóok’sal

source: Privacy
yua: Chen tu wóok’sale’

source: Privacy Notice
yua: Ts’áab ojelbil bix u kana’antal ati’alo’

source: Privacy & Security
yua: Ta wóok’sal yéetel Jeets’el óol

source: Protections are OFF for this site
yua: Le protecciones táan OFF uti'al le ts'ono'oto'

source: Protections are ON for this site
yua: Le protecciones táan ON uti'al le ts'ono'oto'

source: Reload website
yua: Ka’a chuupuk le tseelil webe’

source: Remote debugging via USB/Wi-Fi
yua: Náach púusbil yéetel USB/Wi-Fi

source: Remove all websites
yua: Luk'es tuláakal le yáanal lu'umo'

source: Remove custom URLs
yua: Tuupuk le URL tsikbe’enilta’ab

source: Remove from Shortcuts
yua: Luk'es ti' le atajos

source: Remove search engines
yua: Túupuk u múuk’il ti’ u kaxan ba’al máak ich web

source: Rename
yua: K'ex u k'aaba'

source: Report Site Issue
yua: A'al u táalamil te'e túux tan kaxtiko'

source: Request desktop site
yua: K'áat le kúuchila' tu'ux k'áabet u k'áataj

source: Request support
yua: K'áatik áantaj

source: Request to support site submitted.
yua: K'áat chi' uti'al u yáanta'al le ts'ono'oto' ts'o'ok u túuxta'al.

source: Restore default search engines
yua: Ts’áabak tu ka’aten le u yáax múuk’il ti’ u kaxan ba’al máak ich web

source: Return to your favorite sites in %1$s quickly. Just select \"Add to Home screen\" from the %1$s menu.
yua: Súutnen séebanil ti’ a tseel web uts ta wicho’ ich %1$s. Yéey \"ts’áabak ich u yáax tseel web\" lik’ul u ts’íibil tsoolanilo’ob %1$s.

source: Saved and shared images <b>will not be</b> deleted when you erase %1$s history
yua: Le oochelo'ob ts'o'ok u ta'akbesa'alo'ob yéetel ts'aiko'obo' <b>ma' yaan u</b> tselik le ken a tu'upul %1$s k'ajláayo'

source: Search engine
yua: U múuk'il a kaxant ba'al

source: Search engine name
yua: U k’áaba’ ti’ u múuk’il ti’ u kaxan ba’al máak ich web

source: Search for %1$s
yua: Kaxbil %1$s

source: Search in Focus
yua: Kaxant ti' Focus

source: Search in Focus Beta
yua: Kaxant ti' Focus Beta

source: Search in Focus Nightly
yua: Kaxant ti' Focus Nightly

source: Searching for something different? Choose another default search engine in Settings.
yua: ¿Ka kaxtik ba’al jela’anil wa’a? Yéey u jela’anil u múuk’il a kaxan ba’al ta yéeytaj yáax táanile’ ich le ba’ila’.

source: Search in Klar
yua: Kaxant ti' Klar

source: Search or enter address
yua: Kaxbil wa oksaj tu'uxi’

source: Search Privately
yua: Kaxta'ak men chen teech

source: Search string to use
yua: Kaxbil nuupul uti’al meyajta’al

source: Search widget
yua: Widget u kaxant

source: Secure connection
yua: Utsil nuupankil

source: Secure Connection
yua: Uts nuupankil

source: Security
yua: Kana'antbil

source: See fewer banners by automatically rejecting cookie requests, when possible.
yua: Ilawil menos banners tumen rechazar automáticamente solicitudes cookies, ken páajtal.

source: Select your preferred engine:
yua: Yéey a kisbuuts'o' a k'áat:

source: Send crash report to Mozilla
yua: Túuxt informe ti' Mozilla

source: Send usage data
yua: Túuxtej buka’aj ts’óok a xupik

source: Server not found
yua: Ma’ kaxta’ab le núukulil ku ts’a’ik internet

source: Set %1$s as your default browser and get the benefits of private browsing when you open webpages from other apps.
yua: Ts’a’a %1$s bey a kaxan ba’al a yéeymaj ka wilik le ma’alobil kaxan ba’al tu’ux u kanáantal le a wóok’sal ken a je’ik jejelas tseel web lik’ulil yaanal ba’ilob.

source: Set as default browser
yua: Ts'áa bey navegador tumen defecto

source: Set by Battery Saver
yua: Je'ets'el tumen Battery Saver

source: Set default, autocomplete
yua: Ts’íibta’ab le ta yáax ts’íibo’, ka chuupuk tu juunaj

source: settings
yua: máak’anbil

source: Share…
yua: Ka túuxtik ti'…

source: Share via
yua: Túuxbil yéetel

source: Shortcut name
yua: K'aaba' le atajo

source: Shortcut will open with Enhanced Tracking Protection disabled
yua: Le atajo ku je'ek'abtik yéetel protección u seguimiento mejorada desactivada

source: Shortcut will open with Tracking Protection disabled
yua: Le páajtalil u je’ebek jumpulile’ ku je’ebek yéetel xma’ kananbil a kaxan ba’al

source: Show search suggestions?
yua: We'esik sugerencias xookilo'?

source: Site behaving unexpectedly? Try turning off Tracking Protection
yua: Le ts'ono'oto' ku bisikuba ma' táan u páa'ta'al? K'aax u tu'upul le protección ti' seguimiento

source: Site currently not supported
yua: Le ts'ono'oto' bejla'e' ma' táan u yáanta'al

source: Site permissions
yua: Permisos ti' le ts'ono'oto'

source: Site Security
yua: U jéets’elil te’e tu’uxilo’

source: Skip
yua: Síit

source: Social
yua: Sosial

source: Some ads track site visits, even if you don’t click the ads
yua: Yáan koonol ba’alob ku kaxantik a xíimbalil ich le tu’uxilo’, kex ma’ tan péets’ik yóok’olo’

source: Some search engines cannot show suggestions.
yua: Yáan jejelas kaxant ba'alo'ob mun páajtal u ya'aliktech tu'ux a kaxantik.

source: Sorry. We’re having a problem with this tab.
yua: Sa'asteni. Táan k yantal jump'éel talamil yéetel le ju'unil tu'ux yaan.

source: %s | OSS Libraries
yua: %s | Bibliotecas OSS

source: Start your private browsing session, and we’ll block trackers and other bad stuff as you go.
yua: Káajsik a sesión u navegación privada, ka bloquearemos rastreadores yéetel uláak' ba'alo'ob k'aas bey tech bin.

source: Stealth
yua: Mun yila’al

source: Stop loading website
yua: P’áatak u chuupul le tseelil webe’

source: Studies
yua: Xook

source: Switching Apps
yua: K’exlantik biilalo’ob

source: Switch to link in new tab immediately
yua: K'eexbil ka nuupuk ich túumben nu'ukbesaj séebanil

source: System default
yua: U biilal yáax ts’íibtaj ti’ le nuupankil meyajilo’

source: Tab Crashed
yua: Le cha’anila’ k’aschaji

source: Tab’s browsing history has been erased.
yua: U k'ajláayo' u navegación le ficha ts'o'ok u borrado.

source: Tabs open: %1$s
yua: U nu’ukbesaj ts’íibilo’ jeba’anil: %1$s

source: Take private browsing to the next level. Block ads and other content that can track you across sites and bog down page load times.
yua: Bis táanxil tu’ux le a maansajil ich web yéetel u ba’il a wóok’sal. Ma’ cha’ik u chíikpajal le koonol ba’alobo’ wa u láak’ ba’il ku kaxtikech ich le tseel web tu’ux ka maano’ uti’al u chaambelkúunsik a wéensik ba’alob te’ webo’.

source: Tap here to trash it all — history, cookies, everything — and start fresh on a new tab.
yua: Pulse waye' uti'al u p'atik tuláakal — k'ajláayo', cookies, tuláakal — ka káajsik tu ka'atéen ti' jump'éel túumben ficha.

source: Tap or clear this notification to securely erase your browsing history.
yua: Pulse wa borrar le notificación utia'al u borrar seguramente u historial navegación.

source: Tap or swipe this notification to securely erase your browsing history.
yua: Pulse wa desliza le notificación utia'al u borrar seguramente u historial navegación.

source: The application will quit to apply changes
yua: Le ka'anatako'ob yaan u p'atik uti'al u ts'áaik k'eexo'ob

source: Theme
yua: Chichil

source: These default settings offer strong protection. But it’s easy to tweak the settings to meet your specific needs.
yua: Le configuración tumen defecto ku ts'abal jump'éel k'a'am protección. Ba'ale' chéen ch'a'abil u ajustar le configuración utia'al u satisfacer u kajtalo'ob ichil específicas.

source: This could be a problem with the server’s configuration, or it could be someone trying to impersonate the server. <br/><br/> If you’ve connected to this server successfully in the past, the error may be temporary.
yua: Le je'ela' je'el u páajtal u jump'éel talamil yéetel u configuración le servidor, wa je'el u páajtal u yaantal máax táan u yilik u beetik bey le servidor. <br/><br/> Wa ts'o'ok a conectar ti' le servidor belal ti' le pasado, le ba'alo' je'el u páajtal u temporal.

source: This helps Mozilla to estimate active users.
yua: Le je'ela' ku yáantik Mozilla u estimar le usuarios activos.

source: This site doesn’t support HTTPS
yua: Le ts'ono'oto' ma' tu yáanta'al HTTPS

source: This site is currently not supported by Cookie Banner Reduction. Would you like to request our team review this website and add support in the future?
yua: Le ts'ono'oto' bejla'e' ma' táan u yáanta'al tumen Cookie Banner Reduction. ¿A k'áat wa a k'áatik ti' k nu'ukulil u xak'altik le ts'ono'oto' web yéetel u ts'áabal áantaj ti' le k'iino'ob ku taalo'obo'?

source: To allow it:
yua: Utia'al u cha'abal:

source: To exit fullscreen, drag from top and press back
yua: Utia'al u jóok'ol ti' pantalla completa, jíilankilo'ob tak ka'anal ka pulse tak paachil

source: To exit fullscreen, drag from top and use back gesture
yua: Utia'al u jóok'ol pantalla completa, jíilankilo'ob tak ka'anal yéetel meyaj gesto paachil

source: To get suggestions, %1$s needs to send what you type in the address bar to the search engine.
yua: Utia'al u k'amik ba'alo'ob, %1$s k'a'abéet u túuxtik ba'ax ka ts'íibtik te' barra direcciones ti' le kisbuuts'o' xookilo'.

source: Trackers and Scripts to Block
yua: Rastreadores yéetel Scripts uti'al u bloquear

source: Trackers blocked
yua: Kaxan ba'al tupa'anilo'ob

source: Trackers blocked since %s
yua: Le rastreadores bloqueados tak %s

source: Tracking, cookies, data choices
yua: Bixil ka kaxantik ba’alob, cookies, yéetel péeksilil

source: Tracking Protection
yua: Kana’anbil le bixil ka kaxantik

source: Turning this off may fix some site problems
yua: Wa ka tu'upul le je'ela' je'el u yutskíintik yaan talamilo'ob ti' le ts'ono'oto'

source: Turn off Cookie Banner Reduction for %1$s?
yua: Tu'upul u xu'ulsa'al le banner cookies uti'al %1$s?

source: Turn off tips on the start screen
yua: Tu'upul le consejos ti' le pantalla Chúunul

source: Turn off to fix some sites
yua: Tu'upul uti'al u yutskíinta'al yaan lu'umo'ob

source: Turn on Cookie Banner Reduction for %1$s?
yua: T'abik u xu'ulsa'al le banner cookies uti'al %1$s?

source: Unlock
yua: Je'e

source: Unlock using fingerprint if you’ve added Shortcuts or when a website is already open in %s.
yua: Je'ek'abt yéetel u huella dactilar wa ts'o'ok a ts'áaik atajos wa ken ts'o'ok u je'ebel jump'éel ts'ono'oto' web ti' %s.

source: URL already exists
yua: Le URL yani’

source: URL Autocomplete
yua: Chuupuk tu juunaj URL

source: URL copied
yua: URL k'expajal

source: URL to add
yua: URL uti’al u ts’áabak

source: Used to collect, analyze and measure activities like tapping and scrolling
yua: Beelankil uti’al moolbil, túukulbil yéetel p’iisbil péeksilo’ob je’e bey le ku máachaj bey xan ku jakchajal

source: Use fingerprint to unlock app
yua: Meyajt u huella dactilar uti'al u je'ebel le app

source: Verified by: %1$s
yua: Ila’abij men: %1$s

source: Web Content
yua: Ba’alob U ba’il web

source: Website loaded
yua: Le tseelil webe’ ts’óok u chuupul

source: We clear your history when you close the app for extra privacy.
yua: K tselik a k'ajláayo' ken a muts'ik le ka'anatako'ob uti'al u yantaltech uláak' yojeta'al mixba'al.

source: Welcome to %1$s
yua: Bienvenido ti' %1$s

source: We’ll leave you to your private browsing, but get a quicker start next time with the %1$s widget on your Home screen.
yua: Yaan k p'atik ti' a navegación privada, ba'ale' káajsik asab séeba'an u láak' ka'atéen yéetel le widget %1$s ti' a pantalla Chúunul.

source: What’s New
yua: Túumbenilo'ob

source: Widget added to home screen
yua: Widget ts'áabal ti' pantalla Chúunul

source: Would you like to block cookies?
yua: A k'áat a k'alik le cookies?

source: YES
yua: JE’ELE’

source: Yes please
yua: Jaaj, beet uts

source: You are not granted any rights or licenses to the trademarks of the Mozilla Foundation or any party, including the Mozilla, Firefox or %1$s names or logos. Additional information may be found <a href="%2$s">here</a>.
yua: Ma’ u ts’áabal tojbe’enilob wa páajtalilo’ob ti’ le koonol ba’alob yáan u k’áaba’ob ich le moolayil Mozilla Foundation wa je’e ba’axak jaatsile’, mix u k’áaba’ob yéetel u yoochelo’ob Mozilla, Firefox o %1$s. Je’el u beytal u k’ajotal yaanal ba’ax <a href="%2$s">waye’</a>.

source: You can leave %1$s to open this link in %2$s.
yua: Je’el u beytal a jóok’oj ti’ %1$s uti’al a je’ik le nuupankila’ ich %2$s.

source: You can use your fingerprint to continue your current app session.
yua: Je'el u páajtal a meyajtik a huella dactilar uti'al a t'u'uchpachtik a sesión app actual.

source: You have disabled content blocking for these websites.
yua: Ts'o'ok a desactivar le bloqueo contenido utia'al le k'iino'oba' yáanal lu'umo'.

source: Your autocomplete list:
yua: U tsoolol autocompletar:

source: Your browsing history has been erased.
yua: Lúubsa'ab tuláakal ba'ax ta kaxtej.

source: You’re protected!
yua: Kanáanta'anech!

source: Your Rights
yua: A tojbe'enilo'ob

source: Your search, your way
yua: A kaxan ba’al, je’e bey a k’áato’
